In [1]:
import pandas as pd
import numpy as np
import pymysql
import getpass

In [2]:
pw = getpass.getpass()

········

In [3]:
conn = pymysql.connect(host="localhost",
                       port=3306,
                       user="ironhack",
                       passwd=pw,
                       db="bank")

In [4]:
transactions = pd.read_sql("SELECT * FROM trans;", conn)

In [5]:
transactions.describe()

,trans_id,account_id,date,amount,balance,account
count,8.680190e+05,868019.000000,868019.000000,868019.000000,868019.000000,8.680190e+05
mean,1.440667e+06,2950.988970,965528.499199,5430.072479,38385.785573,9.693615e+06
std,1.285451e+06,2480.958488,13985.762119,9381.422547,22138.967363,2.341477e+07
min,1.000000e+00,1.000000,930101.000000,0.000000,-41125.700000,0.000000e+00
25%,4.528845e+05,1214.000000,960113.000000,100.000000,22360.750000,0.000000e+00
50%,9.064900e+05,2454.000000,970401.000000,1380.000000,33001.000000,0.000000e+00
75%,2.750922e+06,3677.000000,980215.000000,6100.000000,49246.400000,0.000000e+00
max,3.682987e+06,11382.000000,981231.000000,87400.000000,209637.000000,9.999420e+07

In [7]:
transactions.dtypes

trans_id        int64
account_id      int64
date            int64
type           object
operation      object
amount        float64
balance       float64
k_symbol       object
bank           object
account         int64
dtype: object

In [8]:
pd.to_datetime(transactions["date"], infer_datetime_format=True)

0        1970-01-01 00:00:00.000930101
1        1970-01-01 00:00:00.000930101
2        1970-01-01 00:00:00.000930101
3        1970-01-01 00:00:00.000930101
4        1970-01-01 00:00:00.000930102
                      ...
868014   1970-01-01 00:00:00.000981231
868015   1970-01-01 00:00:00.000981231
868016   1970-01-01 00:00:00.000981231
868017   1970-01-01 00:00:00.000981231
868018   1970-01-01 00:00:00.000981231
Name: date, Length: 868019, dtype: datetime64[ns]

didn't work

In [12]:
transactions["date"] = pd.to_datetime("19"+transactions["date"].astype(str), infer_datetime_format=True)

In [15]:
transactions["date"].value_counts().sort_index()

1993-01-01       4
1993-01-02       2
1993-01-03       5
1993-01-04       4
1993-01-05       2
              ...
1998-12-27     235
1998-12-28     198
1998-12-29     214
1998-12-30     216
1998-12-31    4501
Name: date, Length: 2191, dtype: int64

In [16]:
transactions["date"].dt.year

0         1993
1         1993
2         1993
3         1993
4         1993
          ...
868014    1998
868015    1998
868016    1998
868017    1998
868018    1998
Name: date, Length: 868019, dtype: int64

In [18]:
transactions["date"].dt.to_period("M")

0         1993-01
1         1993-01
2         1993-01
3         1993-01
4         1993-01
           ...
868014    1998-12
868015    1998-12
868016    1998-12
868017    1998-12
868018    1998-12
Name: date, Length: 868019, dtype: period[M]

In [20]:
(transactions["date"]
 .dt
 .to_period("M")
 .value_counts()
 .sort_index())

1993-01      165
1993-02      360
1993-03      604
1993-04      821
1993-05     1166
           ...
1998-08    20678
1998-09    20552
1998-10    20716
1998-11    20379
1998-12    18036
Freq: M, Name: date, Length: 72, dtype: int64